zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70b/component/matrix.h
/* -------- CCFG_PCCR : (MATRIX Offset: 0x118) (R/W 32) Peripheral Clock Configuration Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :20;                       /**< bit:  0..19  Reserved */
    uint32_t TC0CC:1;                   /**< bit:     20  TC0 Clock Configuration                  */
    uint32_t I2SC0CC:1;                 /**< bit:     21  I2SC0 Clock Configuration                */
    uint32_t I2SC1CC:1;                 /**< bit:     22  I2SC1 Clock Configuration                */
    uint32_t :9;                        /**< bit: 23..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} CCFG_PCCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CCFG_PCCR_OFFSET                    (0x118)                                       /**<  (CCFG_PCCR) Peripheral Clock Configuration Register  Offset */

#define CCFG_PCCR_TC0CC_Pos                 20                                             /**< (CCFG_PCCR) TC0 Clock Configuration Position */
#define CCFG_PCCR_TC0CC_Msk                 (_U_(0x1) << CCFG_PCCR_TC0CC_Pos)              /**< (CCFG_PCCR) TC0 Clock Configuration Mask */
#define CCFG_PCCR_TC0CC                     CCFG_PCCR_TC0CC_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use CCFG_PCCR_TC0CC_Msk instead */
#define CCFG_PCCR_I2SC0CC_Pos               21                                             /**< (CCFG_PCCR) I2SC0 Clock Configuration Position */
#define CCFG_PCCR_I2SC0CC_Msk               (_U_(0x1) << CCFG_PCCR_I2SC0CC_Pos)            /**< (CCFG_PCCR) I2SC0 Clock Configuration Mask */
#define CCFG_PCCR_I2SC0CC                   CCFG_PCCR_I2SC0CC_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use CCFG_PCCR_I2SC0CC_Msk instead */
#define CCFG_PCCR_I2SC1CC_Pos               22                                             /**< (CCFG_PCCR) I2SC1 Clock Configuration Position */
#define CCFG_PCCR_I2SC1CC_Msk               (_U_(0x1) << CCFG_PCCR_I2SC1CC_Pos)            /**< (CCFG_PCCR) I2SC1 Clock Configuration Mask */
#define CCFG_PCCR_I2SC1CC                   CCFG_PCCR_I2SC1CC_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use CCFG_PCCR_I2SC1CC_Msk instead */
#define CCFG_PCCR_MASK                      _U_(0x700000)                                  /**< \deprecated (CCFG_PCCR) Register MASK  (Use CCFG_PCCR_Msk instead)  */
#define CCFG_PCCR_Msk                       _U_(0x700000)                                  /**< (CCFG_PCCR) Register Mask  */


/* -------- CCFG_DYNCKG : (MATRIX Offset: 0x11c) (R/W 32) Dynamic Clock Gating Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MATCKG:1;                  /**< bit:      0  MATRIX Dynamic Clock Gating              */
    uint32_t BRIDCKG:1;                 /**< bit:      1  Bridge Dynamic Clock Gating Enable       */
    uint32_t EFCCKG:1;                  /**< bit:      2  EFC Dynamic Clock Gating Enable          */
    uint32_t :29;                       /**< bit:  3..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} CCFG_DYNCKG_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CCFG_DYNCKG_OFFSET                  (0x11C)                                       /**<  (CCFG_DYNCKG) Dynamic Clock Gating Register  Offset */

#define CCFG_DYNCKG_MATCKG_Pos              0                                              /**< (CCFG_DYNCKG) MATRIX Dynamic Clock Gating Position */
#define CCFG_DYNCKG_MATCKG_Msk              (_U_(0x1) << CCFG_DYNCKG_MATCKG_Pos)           /**< (CCFG_DYNCKG) MATRIX Dynamic Clock Gating Mask */
#define CCFG_DYNCKG_MATCKG                  CCFG_DYNCKG_MATCKG_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use CCFG_DYNCKG_MATCKG_Msk instead */
#define CCFG_DYNCKG_BRIDCKG_Pos             1                                              /**< (CCFG_DYNCKG) Bridge Dynamic Clock Gating Enable Position */
#define CCFG_DYNCKG_BRIDCKG_Msk             (_U_(0x1) << CCFG_DYNCKG_BRIDCKG_Pos)          /**< (CCFG_DYNCKG) Bridge Dynamic Clock Gating Enable Mask */
#define CCFG_DYNCKG_BRIDCKG                 CCFG_DYNCKG_BRIDCKG_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use CCFG_DYNCKG_BRIDCKG_Msk instead */
#define CCFG_DYNCKG_EFCCKG_Pos              2                                              /**< (CCFG_DYNCKG) EFC Dynamic Clock Gating Enable Position */
#define CCFG_DYNCKG_EFCCKG_Msk              (_U_(0x1) << CCFG_DYNCKG_EFCCKG_Pos)           /**< (CCFG_DYNCKG) EFC Dynamic Clock Gating Enable Mask */
#define CCFG_DYNCKG_EFCCKG                  CCFG_DYNCKG_EFCCKG_Msk                         /**< \deprecated Old style mask definition for 1 bit bitfield. Use CCFG_DYNCKG_EFCCKG_Msk instead */
#define CCFG_DYNCKG_MASK                    _U_(0x07)                                      /**< \deprecated (CCFG_DYNCKG) Register MASK  (Use CCFG_DYNCKG_Msk instead)  */
#define CCFG_DYNCKG_Msk                     _U_(0x07)                                      /**< (CCFG_DYNCKG) Register Mask  */


/* -------- CCFG_SMCNFCS : (MATRIX Offset: 0x124) (R/W 32) SMC NAND Flash Chip Select Configuration Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t SMC_NFCS0:1;               /**< bit:      0  SMC NAND Flash Chip Select 0 Assignment  */
    uint32_t SMC_NFCS1:1;               /**< bit:      1  SMC NAND Flash Chip Select 1 Assignment  */
    uint32_t SMC_NFCS2:1;               /**< bit:      2  SMC NAND Flash Chip Select 2 Assignment  */
    uint32_t SMC_NFCS3:1;               /**< bit:      3  SMC NAND Flash Chip Select 3 Assignment  */
    uint32_t SDRAMEN:1;                 /**< bit:      4  SDRAM Enable                             */
    uint32_t :27;                       /**< bit:  5..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t SMC_NFCS:4;                /**< bit:   0..3  SMC NAND Flash Chip Select x Assignment  */
    uint32_t :28;                       /**< bit:  4..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} CCFG_SMCNFCS_Type;
